Vector-m/Barosensor/stm32_tic149.c

#include "stm32_tic149.h"

void i2c_start(void){

	I2C_GenerateSTART(I2C1, ENABLE);
	GPIOB->ODR |= GPIO_ODR_ODR2; //RED LED ON
	while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_MODE_SELECT));
	GPIOB->ODR &= ~GPIO_ODR_ODR2;//RED LED OFF
}

void i2c_stop(void){
	I2C_GenerateSTOP(I2C1, ENABLE);      // send STOP condition
}

void i2c_tx_adr (unsigned char sl_adr){


								I2C_Send7bitAddress(I2C1, sl_adr, I2C_Direction_Transmitter);
	    	 	 	 	 		 GPIOB->ODR |= GPIO_ODR_ODR2; //RED LED ON
	    	 	 	 	 		 while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED ));
	    	 	 	 	 		 GPIOB->ODR &= ~GPIO_ODR_ODR2;//RED LED OFF
}


void i2c_tx (unsigned char data_tr){
							I2C_SendData(I2C1,data_tr);
	    	 	 	 	 	 while(!I2C_CheckEvent(I2C1, I2C_EVENT_MASTER_BYTE_TRANSMITTED ));
}


void PAUSE_MS(unsigned long ms)// delay 1 ms per count @ Crystal 8.0 MHz and PLL9x or SYSCLK = 72 MHz
{
   volatile unsigned long i,j;
   for (i = 0; i < ms; i++ )
   for (j = 0; j < 5525; j++ );
}

 const  char font[][6] =
{
 //0x20 и далее (0x00-0x60)
 {0x00,0x00,0x00,0x00,0x00,0x00},                    //пробел
 {0x00,0x00,0x4f,0x00,0x00,0x00},                    //!
 {0x00,0x07,0x00,0x07,0x00,0x00},                    //"
 {0x14,0x7f,0x14,0x7f,0x14,0x00},                    //#
 {0x24,0x2a,0x7f,0x2a,0x12,0x00},                    //$   
 {0x23,0x13,0x08,0x64,0x62,0x00},                    //%
 {0x36,0x49,0x55,0x22,0x40,0x00},                    //&
 {0x00,0x05,0x03,0x00,0x00,0x00},                    //,
 {0x00,0x1c,0x22,0x41,0x00,0x00},                    //(      
 {0x00,0x41,0x22,0x1c,0x00,0x00},                    //)     
 {0x14,0x08,0x3E,0x08,0x14,0x00},                    //*     
 {0x08,0x08,0x3E,0x08,0x08,0x00},                    //+
 {0x00,0x50,0x30,0x00,0x00,0x00},                    //,
 {0x08,0x08,0x08,0x08,0x08,0x00},                    //-
 {0x00,0x60,0x60,0x00,0x00,0x00},                    //.
 {0x20,0x10,0x08,0x04,0x02,0x00},                    ///
 
 {0x3e,0x51,0x49,0x45,0x3e,0x00},                    //0
 {0x00,0x42,0x7f,0x40,0x00,0x00},                    //1
 {0x42,0x61,0x51,0x49,0x46,0x00},                    //2
 {0x21,0x41,0x45,0x4b,0x31,0x00},                    //3
 {0x18,0x14,0x12,0x7f,0x10,0x00},                    //4
 {0x27,0x45,0x45,0x45,0x39,0x00},                    //5
 {0x3c,0x4a,0x49,0x49,0x30,0x00},                    //6
 {0x01,0x71,0x09,0x05,0x03,0x00},                    //7
 {0x36,0x49,0x49,0x49,0x36,0x00},                    //8
 {0x06,0x49,0x49,0x29,0x1e,0x00},                    //9
 {0x00,0x36,0x36,0x00,0x00,0x00},                    //:
 {0x00,0x56,0x36,0x00,0x00,0x00},                    //;
 {0x08,0x14,0x22,0x41,0x00,0x00},                    //<      
 {0x14,0x14,0x14,0x14,0x14,0x00},                    //=
 {0x00,0x41,0x22,0x14,0x08,0x00},                    //>     
 {0x02,0x01,0x51,0x09,0x06,0x00},                    //?
 
 {0x32,0x49,0x71,0x41,0x3e,0x00},                    //@
 {0x7e,0x11,0x11,0x11,0x7e,0x00},                    //A
 {0x7f,0x49,0x49,0x49,0x36,0x00},                    //B
 {0x3e,0x41,0x41,0x41,0x22,0x00},                    //C
 {0x7f,0x41,0x41,0x22,0x1c,0x00},                    //D
 {0x7f,0x49,0x49,0x49,0x41,0x00},                    //E
 {0x7f,0x09,0x09,0x09,0x01,0x00},                    //F
 {0x3e,0x41,0x49,0x49,0x3a,0x00},                    //G
 {0x7f,0x08,0x08,0x08,0x7f,0x00},                    //H
 {0x00,0x41,0x7f,0x41,0x00,0x00},                    //I
 {0x20,0x40,0x41,0x3f,0x01,0x00},                    //J
 {0x7f,0x08,0x14,0x22,0x41,0x00},                    //K
 {0x7f,0x40,0x40,0x40,0x40,0x00},                    //L
 {0x7f,0x02,0x0c,0x02,0x7f,0x00},                    //M
 {0x7f,0x04,0x08,0x10,0x7f,0x00},                    //N
 {0x3e,0x41,0x41,0x41,0x3e,0x00},                    //O
 
 {0x7f,0x09,0x09,0x09,0x06,0x00},                    //P
 {0x3e,0x41,0x51,0x21,0x5e,0x00},                    //Q
 {0x7f,0x09,0x19,0x29,0x46,0x00},                    //R
 {0x46,0x49,0x49,0x49,0x31,0x00},                    //S
 {0x01,0x01,0x7f,0x01,0x01,0x00},                    //T
 {0x3f,0x40,0x40,0x40,0x3f,0x00},                    //U
 {0x1f,0x20,0x40,0x20,0x1f,0x00},                    //V
 {0x3f,0x40,0x70,0x40,0x3f,0x00},                    //W
 {0x63,0x14,0x08,0x14,0x63,0x00},                    //X
 {0x07,0x08,0x70,0x08,0x07,0x00},                    //Y
 {0x61,0x51,0x49,0x45,0x43,0x00},                    //Z
 {0x00,0x7F,0x41,0x41,0x00,0x00},                    //[
 {0x02,0x04,0x08,0x10,0x20,0x00},                    /* \ */
 {0x00,0x41,0x41,0x7F,0x00,0x00},                    //]
 {0x04,0x02,0x01,0x02,0x04,0x00},                    //^
 {0x40,0x40,0x40,0x40,0x40,0x00},                    //_
        
 {0x00,0x01,0x02,0x04,0x00,0x00},                    //'
 {0x20,0x54,0x54,0x54,0x78,0x00},                    //a
 {0x7F,0x48,0x44,0x44,0x38,0x00},                    //b
 {0x38,0x44,0x44,0x44,0x20,0x00},                    //c
 {0x38,0x44,0x44,0x48,0x7F,0x00},                    //d
 {0x38,0x54,0x54,0x54,0x18,0x00},                    //e
 {0x08,0x7E,0x09,0x01,0x02,0x00},                    //f
 {0x0C,0x52,0x52,0x52,0x3E,0x00},                    //g
 {0x7F,0x08,0x04,0x04,0x78,0x00},                    //h
 {0x00,0x44,0x7D,0x40,0x00,0x00},                    //i
 {0x20,0x40,0x44,0x3D,0x00,0x00},                    //j
 {0x7F,0x10,0x28,0x44,0x00,0x00},                    //k
 {0x00,0x41,0x7F,0x40,0x00,0x00},                    //l
 {0x7C,0x04,0x18,0x04,0x78,0x00},                    //m
 {0x7C,0x08,0x04,0x04,0x78,0x00},                    //n
 {0x38,0x44,0x44,0x44,0x38,0x00},                    //o
 
 {0x7C,0x14,0x14,0x14,0x08,0x00},                    //p
 {0x08,0x14,0x14,0x18,0x7C,0x00},                    //q
 {0x7C,0x08,0x04,0x04,0x08,0x00},                    //r
 {0x48,0x54,0x54,0x54,0x20,0x00},                    //s
 {0x04,0x3F,0x44,0x40,0x20,0x00},                    //t
 {0x3C,0x40,0x40,0x20,0x7C,0x00},                    //u
 {0x1C,0x20,0x40,0x20,0x1C,0x00},                    //v
 {0x3C,0x40,0x30,0x40,0x3C,0x00},                    //w
 {0x44,0x28,0x10,0x28,0x44,0x00},                    //x
 {0x0C,0x50,0x50,0x50,0x3C,0x00},                    //y
 {0x44,0x64,0x54,0x4C,0x44,0x00},                    //z
 {0x00,0x08,0x36,0x41,0x00,0x00},                    //{
 {0x00,0x00,0x7f,0x00,0x00,0x00},                    //|
 {0x00,0x41,0x36,0x08,0x00,0x00},                    //}
 {0x02,0x01,0x02,0x02,0x01,0x00},                    //~
 {0x00,0x00,0x00,0x00,0x00,0x00},                    //резерв
 // 0x7f 
 //0xc0 и далее русские (0x60-0xa0)
 {0x7e,0x11,0x11,0x11,0x7e,0x00},                    //A
 {0x7f,0x49,0x49,0x49,0x33,0x00},                    //Б
 {0x7f,0x49,0x49,0x49,0x36,0x00},                    //В
 {0x7f,0x01,0x01,0x01,0x03,0x00},                    //Г
 {0xe0,0x51,0x4f,0x41,0xff,0x00},                    //Д
 {0x7f,0x49,0x49,0x49,0x41,0x00},                    //E
 {0x77,0x08,0x7f,0x08,0x77,0x00},                    //Ж
 {0x41,0x49,0x49,0x49,0x36,0x00},                    //З
 {0x7f,0x10,0x08,0x04,0x7f,0x00},                    //И
 {0x7c,0x21,0x12,0x09,0x7c,0x00},                    //Й
 {0x7f,0x08,0x14,0x22,0x41,0x00},                    //K
 {0x20,0x41,0x3f,0x01,0x7f,0x00},                    //Л
 {0x7f,0x02,0x0c,0x02,0x7f,0x00},                    //M
 {0x7f,0x08,0x08,0x08,0x7f,0x00},                    //H
 {0x3e,0x41,0x41,0x41,0x3e,0x00},                    //O
 {0x7f,0x01,0x01,0x01,0x7f,0x00},                    //П
 
 {0x7f,0x09,0x09,0x09,0x06,0x00},                    //P
 {0x3e,0x41,0x41,0x41,0x22,0x00},                    //C
 {0x01,0x01,0x7f,0x01,0x01,0x00},                    //T
 {0x47,0x28,0x10,0x08,0x07,0x00},                    //У
 {0x1c,0x22,0x7f,0x22,0x1c,0x00},                    //Ф
 {0x63,0x14,0x08,0x14,0x63,0x00},                    //X
 {0x7f,0x40,0x40,0x40,0xff,0x00},                    //Ц
 {0x07,0x08,0x08,0x08,0x7f,0x00},                    //Ч
 {0x7f,0x40,0x7f,0x40,0x7f,0x00},                    //Ш
 {0x7f,0x40,0x7f,0x40,0xff,0x00},                    //Щ
 {0x01,0x7f,0x48,0x48,0x30,0x00},                    //Ъ
 {0x7f,0x48,0x30,0x00,0x7f,0x00},                    //Ы
 {0x00,0x7f,0x48,0x48,0x30,0x00},                    //Э
 {0x22,0x41,0x49,0x49,0x3e,0x00},                    //Ь
 {0x7f,0x08,0x3e,0x41,0x3e,0x00},                    //Ю
 {0x46,0x29,0x19,0x09,0x7f,0x00},                    //Я
 
 {0x20,0x54,0x54,0x54,0x78,0x00},                    //a
 {0x3c,0x4a,0x4a,0x49,0x31,0x00},                    //б
 {0x7c,0x54,0x54,0x28,0x00,0x00},                    //в
 {0x7c,0x04,0x04,0x04,0x0c,0x00},                    //г
 {0xe0,0x54,0x4c,0x44,0xfc,0x00},                    //д
 {0x38,0x54,0x54,0x54,0x18,0x00},                    //e
 {0x6c,0x10,0x7c,0x10,0x6c,0x00},                    //ж
 {0x44,0x44,0x54,0x54,0x28,0x00},                    //з
 {0x7c,0x20,0x10,0x08,0x7c,0x00},                    //и
 {0x7c,0x41,0x22,0x11,0x7c,0x00},                    //й
 {0x7c,0x10,0x28,0x44,0x00,0x00},                    //к
 {0x20,0x44,0x3c,0x04,0x7c,0x00},                    //л
 {0x7c,0x08,0x10,0x08,0x7c,0x00},                    //м
 {0x7c,0x10,0x10,0x10,0x7c,0x00},                    //н
 {0x38,0x44,0x44,0x44,0x38,0x00},                    //o
 {0x7c,0x04,0x04,0x04,0x7c,0x00},                    //п
 
 {0x7C,0x14,0x14,0x14,0x08,0x00},                    //p 
 {0x38,0x44,0x44,0x44,0x20,0x00},                    //c
 {0x04,0x04,0x7c,0x04,0x04,0x00},                    //т
 {0x0C,0x50,0x50,0x50,0x3C,0x00},                    //у
 {0x30,0x48,0xfc,0x48,0x30,0x00},                    //ф
 {0x44,0x28,0x10,0x28,0x44,0x00},                    //x
 {0x7c,0x40,0x40,0x40,0xfc,0x00},                    //ц
 {0x0c,0x10,0x10,0x10,0x7c,0x00},                    //ч
 {0x7c,0x40,0x7c,0x40,0x7c,0x00},                    //ш
 {0x7c,0x40,0x7c,0x40,0xfc,0x00},                    //щ
 {0x04,0x7c,0x50,0x50,0x20,0x00},                    //ъ
 {0x7c,0x50,0x50,0x20,0x7c,0x00},                    //ы
 {0x7c,0x50,0x50,0x20,0x00,0x00},                    //ь
 {0x28,0x44,0x54,0x54,0x38,0x00},                    //э
 {0x7c,0x10,0x38,0x44,0x38,0x00},                    //ю
 {0x08,0x54,0x34,0x14,0x7c,0x00},                    //я
 //0xff
 
};

/* инициализация драйвера PCF8535*/

void LCD_init(void){

        //LCD_RESET = 1;   // вывели lcd из ресета



        i2c_start();

        i2c_tx_adr(tic149_ADDR);  // адрес
        i2c_tx(0x00);      // control byte
        i2c_tx(0x01);      // на основн стр

        i2c_tx(0x0E);      // на стр 110
        i2c_tx(0x12);      // BIAS = 1/9
        i2c_tx(0x84);      // MUX = 1/65
        i2c_tx(0x04);      // D = 0, E = 0;
        i2c_tx(0x24);      // IB = 1
//      i2c_tx(0x20);      // IB = 0
        i2c_tx(0x0E);      // MX = 1, MY = 1;
//      i2c_tx(0x0C);      // MX = 1, MY = 0;

        i2c_tx(0x01);      // на основн стр
        i2c_tx(0x10);      // PD = 0, V = 0; горизонтальная адресация
//      i2c_tx(0x12);      // PD = 0, V = 0; вертикальная

        i2c_tx(0x0B);      // на стр 011
        i2c_tx(0x58);      // TRS = 1, BRS = 1;
        i2c_tx(0x05);      // DM = 1

        PAUSE_MS(10);

        i2c_tx(0x01);      // на основн стр
        i2c_tx(0x0D);      // на стр 101

        i2c_tx(0x08);      // S[1;0] = 00, mul factor = 2
//      i2c_tx(0x06);      // PRS = 1, Vlcd programing range high
        i2c_tx(0x04);      // PRS = 0, Vlcd programing range low

        i2c_tx(47 | 0x80); // установка напряжения
        i2c_tx(0x05);      // включение генератора

        PAUSE_MS(10);       // should be более 20 мкс
        i2c_tx(0x09);      // S[1;0] = 01, mul factor = 3
        PAUSE_MS(10);
        i2c_tx(0x0A);      // S[1;0] = 10, mul factor = 4
        PAUSE_MS(10);
        i2c_tx(0x0B);      // S[1;0] = 11, mul factor = 5

        i2c_tx(0x01);      // на основн стр
        i2c_tx(0x0B);      // на стр 011

        i2c_tx(0x04);      // DM = 0

        i2c_tx(0x01);      // на основн стр
        i2c_tx(0x0E);      // на стр 110
        i2c_tx(0x06);      // D = 1, E = 0; normal

        i2c_stop();
        
}


 /* очистка ОЗУ драйвера */

void LCD_clear(void){
  
        unsigned int qwe = 0;
        
        i2c_start();

        i2c_tx_adr(tic149_ADDR);        // адрес
        i2c_tx(0x40);      // control byte

        for(qwe = 0; qwe < 1064; qwe++){
                                             i2c_tx(0x00);
                                             //ClearWDT();
                                            }
        
        i2c_stop();
        
}





void tic149_set_addr(unsigned char y, unsigned char x)
{
    
  
    x*=6;   //позиционируемся не по пикселям, а по знакоместам
    x+=1;   //выравнивем по центру дисплея. Таким образом помещается 22 символа и по краям есть два незадействованных пикселя
    i2c_start();  
    i2c_tx_adr(tic149_ADDR);
    i2c_tx(0x00);                    // control byte

    i2c_tx(0x01);                    // на основн стр
    i2c_tx(0x20);                    // XM0 = 0
    i2c_tx(0x40 | y);
    i2c_tx(0x80 | x);

    i2c_stop();
}



void tic149_put_char(unsigned char c){
    
  
  unsigned char  textL;
 
   if(c<0x90)  textL=0x20;
   else  textL=0x60; 

    i2c_start();
    i2c_tx_adr(tic149_ADDR);
    i2c_tx(0x40);              // control byte

    i2c_tx(bit_reverse(font[c-textL][0]));
    i2c_tx(bit_reverse(font[c-textL][1]));
    i2c_tx(bit_reverse(font[c-textL][2]));
    i2c_tx(bit_reverse(font[c-textL][3]));
    i2c_tx(bit_reverse(font[c-textL][4]));
    i2c_tx(bit_reverse(font[c-textL][5]));
    //i2c_tx(bit_reverse(font[c][6]));

    i2c_stop();
}
void tic149_put_str_op(char *str){
	while(*str) tic149_put_char(*str++);
}





void tic149_put_str(unsigned char y, unsigned char x, char *str){
     tic149_set_addr(y, x);
     while(*str) tic149_put_char(*str++);
}

unsigned char bit_reverse(unsigned char b)
{
    unsigned char res = 0;
    if (b & 0x01) res |= 0x80;
    if (b & 0x02) res |= 0x40;
    if (b & 0x04) res |= 0x20;
    if (b & 0x08) res |= 0x10;
    if (b & 0x10) res |= 0x08;
    if (b & 0x20) res |= 0x04;
    if (b & 0x40) res |= 0x02;
    if (b & 0x80) res |= 0x01;
    return(res);
}

